# 1.匹配整数或者小数(包括正数和负数)
# [-]?(\d+.?\d+|\d+)?

# 2.匹配年月日日期格式,格式2018-12-6
# \d{4}\-\d{1,2}\-\d{1,2}

# 3.匹配QQ号
# [1-9]([0-9]{5,11})

# 4.11位的电话号码
# [1][3-9]\d{9}

# 5.长度为8-10位的用户密码:包含数字字母下划线
# (\w{8,10})?

# 6.匹配验证码:4位数字字母组成
# [0-9a-zA-Z]{4}
# 7.匹配邮箱地址
# \w+@?\w+\.[a-z]+

# 8.从类似
# <a>wahaha</a>
# <a>banana</a>
# <h1>qqxing</h1>
# 这样的字符串中,
#   1.匹配出wahaha,banana,qqxing内容
# \w{6}
#   2.匹配出a,b,h1这样的内容
# (\w\d|\w)|/(\w\d|\w)

# 9.1-2*((60-30+(-40/5)*(9-2*5/3*99/4*2998+10*568/14))-(-4*3)/(16-3*2)
#   从上面算式中匹配出最内层小括号以及小括号内的表达式
# -\d{2}/\d

# 10.从类似9-2*5/3*99/4*2998+10*568/14的表达式中匹配出从左到右第一个乘法或者除法
# (\d\*\d)