# 字符串索引
# s = "disman123"
# print(s[0])
# print(s[1])
# print(s[2])
# print(s[3])
# print(s[4])
# print(s[5])
#
# print(s[-1])
# print(s[-2])
# print(s[-3])

# 通过索引获取到的内容，还是一个字符串
# 切片可以对字符串进行截取
# 语法 s [起始位置:结束位置]
# 特点顾头不顾腚

# s = "python是最好的语言"

# s1 = s[7:9]
# print(s1)
# s2 = s[0:6]+s[7:9]
# print(s2)
# s3 = s[6:] #从第几个到结尾
# print(s3)
# s4 = s[:7] # 从头开始
# print(s4)
# s5 = s[:]
# print(s5) # 从头到尾都切出来

# s6 = s[-2:] # 从-2切到结尾 默认从左往右切
# print(s6)

#步长
# 语法：s[起始位置:结束位置:步长]
# s = "我的步长，我能跳着走"
# s1 = s[1:6:2]  # 从1开始，到5结束，每2个取1个
# print(s1)

# s2 = s[::3]
# print(s2)

# s3 = s[6:2:-1]
# print(s3)

s = "这个标点符号很蛋疼"
# s4 = s[7::-2]
# print(s4)

s5 = s[-1:-6:-2]
print(s5)